app/controllers/boats_controller.rb

  def show
	@boat = Boat.find(params[:id])
	@pairing = Pairing.all
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pairings".* FROM "pairings"

 def create
	   @boat = current_user.boats.new(boat_params)

	 	if @boat.save
---
INSERT INTO "boats" ("created_at", "updated_at", "name", "avail_cont", "user_id", "total_cont") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", 2017-03-06 17:49:07 UTC], ["updated_at", 2017-03-06 17:49:07 UTC], ["name", "mauretania"], ["avail_cont", 0], ["user_id", 2], ["total_cont", 10]]

 	def destroy
		Boat.find(params[:id]).destroy
---
DELETE FROM "boats" WHERE "boats"."id" = ?  [["id", 3]]
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  	def edit
		@boat = Boat.find(params[:id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
	    @boat = Boat.find(params[:id])
	    if @boat.update_attributes(boat_params)
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "boats" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "boats"."id" = ?  [["image_file_name", "cword.jpg"], ["image_file_size", 77621], ["image_updated_at", 2017-03-20 22:18:59 UTC], ["updated_at", 2017-03-20 22:18:59 UTC], ["id", 4]]