app/controllers/pairings_controller.rb

	def create
		pairing = Pairing.new(job_id: params[:job_id], boat_id: params[:boat_id], containers: params[:containers])
		boat = Boat.find(params[:boat_id])

		boat.avail_cont = boat.avail_cont - params[:containers].to_i
		boat.save

		job = Job.find(params[:job_id])
		job.containers = job.containers - params[:containers].to_i

		job.save



		if pairing.save
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "boats" SET "avail_cont" = ?, "updated_at" = ? WHERE "boats"."id" = ?  [["avail_cont", 9], ["updated_at", 2017-03-21 18:25:27 UTC], ["id", 5]]
INSERT INTO "pairings" ("boat_id", "job_id", "created_at", "updated_at", "containers") VALUES (?, ?, ?, ?, ?)  [["boat_id", 5], ["job_id", 4], ["created_at", 2017-03-21 16:20:07 UTC], ["updated_at", 2017-03-21 16:20:07 UTC], ["containers", 90]]